Revit 2026 API

# AdvancedOpaqueOpaqueF0 Property

---

The property labeled "Specular reflectance" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string OpaqueF0 { get; }
```
```vb
Public Shared ReadOnly Property OpaqueF0 As String
	Get
```
```cpp
public:
static property String^ OpaqueF0 {
	String^ get ();
}
```
```fsharp
static member OpaqueF0 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace